[{"data":1,"prerenderedAt":447},["Reactive",2],{"content-query-UM8fir0a9J":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"date":10,"image":11,"draft":6,"body":12,"_type":442,"_id":443,"_source":444,"_file":445,"_extension":446},"/blog/meaning-of-life","blog",false,"","Meaning of Life","The meaning of life is what any sane person would be eager to know. Life's pleasures can distract you from seeking it, but eventually, we will sit down and wonder about the reasons we are here, and the direction we are ultimately headed to. These fundamental questions are often pondered when starting a project. They help direct our actions into the right paths and provide a basis for evaluating what is good or bad. The same principles should apply to our lives, as it is the most important project we will ever undertake.\n","2024-06-09T00:00:00.000Z","/img/mol.jpg",{"type":13,"children":14,"toc":428},"root",[15,23,28,33,38,43,50,55,61,66,71,102,120,125,130,144,149,155,162,167,172,177,183,188,193,198,203,209,214,219,226,231,236,242,247,253,258,264,269,275,280,285,290,304,310,328,333,338,351,357,362],{"type":16,"tag":17,"props":18,"children":19},"element","p",{},[20],{"type":21,"value":22},"text","The meaning of life is what any sane person would be eager to know. Life's pleasures can distract you from seeking it, but eventually, we will sit down and wonder about the reasons we are here, and the direction we are ultimately headed to. These fundamental questions are often pondered when starting a project. They help direct our actions into the right paths and provide a basis for evaluating what is good or bad. The same principles should apply to our lives, as it is the most important project we will ever undertake.",{"type":16,"tag":17,"props":24,"children":25},{},[26],{"type":21,"value":27},"Each individual or community may have a different perspective on life, but this certainly does not mean that all of them are correct. Some people may view the world as a final opportunity to have pleasure, that it is made to be enjoyed, and thus prioritize it above anything else, even if they do not explicitly state it. People also like to build morals for themselves, so you can see that they vary widely between communities and periods. However, morals are like rules for a given game, if you are tasked to define them while being a player, you would certainly put rules that align with your interests, even if you believe you are neutral.",{"type":16,"tag":17,"props":29,"children":30},{},[31],{"type":21,"value":32},"While I do not claim that you will be convinced reading this blog post (let alone this short introduction), my goal is to shed light on the only reliable source of knowledge we have to understand the meaning of life. This source of knowledge that cannot be refuted (if appropriate methods are put in use), is way better than the mainstream model used for answering this question, which is called \"imagination\".",{"type":16,"tag":17,"props":34,"children":35},{},[36],{"type":21,"value":37},"Even if amazing discoveries are being made and were made in the past, I don't know why people believe this will lead us to the meaning of life. Especially when there is no evidence of a relation between discoveries being done, and what people think the meaning of life is. On one side, we have discoveries, and on the other, we have theories. Imagination acts as the link between the two. This self-created link is similar to how people construct morals. There is always a hidden incentive when you blindly believe in something, even if it is just pure arrogance.",{"type":16,"tag":17,"props":39,"children":40},{},[41],{"type":21,"value":42},"As I am opposed to blind belief, the rest of this blog post will cover the meaning of life, explaining where we should seek it, and why it should be considered as evidence.",{"type":16,"tag":44,"props":45,"children":47},"h2",{"id":46},"how-to-read-this-blog-post",[48],{"type":21,"value":49},"How to Read this blog post",{"type":16,"tag":17,"props":51,"children":52},{},[53],{"type":21,"value":54},"I have structured this blog post by separating the core message (explaining the meaning of life briefly) from the rest. The core message is the most essential piece that you should read. Following that, you will find selected topics that are relevant to the core message. They have been randomly arranged, so you can read them in any order that suits you.",{"type":16,"tag":44,"props":56,"children":58},{"id":57},"core-message",[59],{"type":21,"value":60},"Core Message",{"type":16,"tag":17,"props":62,"children":63},{},[64],{"type":21,"value":65},"We are all inevitably headed towards death, and we cannot be prepared for it unless we know what comes after it.",{"type":16,"tag":17,"props":67,"children":68},{},[69],{"type":21,"value":70},"We all know that we neither created ourselves nor created this world. Thus, we cannot know what lies beyond it by ourselves. We need to learn it from its creator. So far, none except Allah has claimed the creation of this world. Of course, people have argued the world was created by other entities. But it is not helpful, because those entities cannot even claim the creation by themselves. The only reliable source left is what the creator revealed to us.",{"type":16,"tag":17,"props":72,"children":73},{},[74,76,90,92,100],{"type":21,"value":75},"History tells us about numerous prophets and messengers, including Abraham, Moses, Noah, Jesus, and Mohamed ",{"type":16,"tag":77,"props":78,"children":79},"sup",{},[80],{"type":16,"tag":81,"props":82,"children":87},"a",{"href":83,"ariaDescribedBy":84,"dataFootnoteRef":7,"id":86},"#user-content-fn-fn1",[85],"footnote-label","user-content-fnref-fn1",[88],{"type":21,"value":89},"1",{"type":21,"value":91},". The Bible and the Quran are some of the scriptures revealed to them. All of the prophets were sent to convey the same message: worship the one and only God (Allah), the only one worthy of worship, the one who created everything, the all-wise, the most merciful, the omniscient, the first, and the last, who has taught us His different ",{"type":16,"tag":81,"props":93,"children":97},{"href":94,"rel":95},"https://www.islamic-relief.org.uk/resources/99-names-of-allah/",[96],"nofollow",[98],{"type":21,"value":99},"names and attributes",{"type":21,"value":101},", for us to understand who He is.",{"type":16,"tag":17,"props":103,"children":104},{},[105,107,118],{"type":21,"value":106},"Allah has informed us about the afterlife, which is eternal. People will either be in Paradise or Hell, based on their deeds. Hell is an unimaginably painful place for those who did not worship Allah alone, whereas Paradise is for those who did worship Allah alone. It is a place of ultimate happiness and serenity, free from any negativity. Many revelations detail both places. They are meant to be a warning for people to run away from Hell, and work for Paradise. You can refer to the Quran ",{"type":16,"tag":77,"props":108,"children":109},{},[110],{"type":16,"tag":81,"props":111,"children":115},{"href":112,"ariaDescribedBy":113,"dataFootnoteRef":7,"id":114},"#user-content-fn-fn2",[85],"user-content-fnref-fn2",[116],{"type":21,"value":117},"2",{"type":21,"value":119}," and Hadith (something the prophet said) if you want to learn more.",{"type":16,"tag":17,"props":121,"children":122},{},[123],{"type":21,"value":124},"After death, everyone will experience a life that is completely different from this one. Then comes the final day, the day of judgment, where everyone would have died, brought back to life, and evaluated based on their actions. They will either enter Paradise or Hell.",{"type":16,"tag":17,"props":126,"children":127},{},[128],{"type":21,"value":129},"I am not asking you to believe blindly in all that I am saying. But as I know with certainty that the consequences of believing/disbelieving are eternal, I strongly urge you to read more about it, starting from the selected topics on the Quran.",{"type":16,"tag":17,"props":131,"children":132},{},[133,135,142],{"type":21,"value":134},"More importantly, I encourage you to read the ",{"type":16,"tag":81,"props":136,"children":139},{"href":137,"rel":138},"https://web.surahapp.com/en/quran?surah=1&view=translation",[96],[140],{"type":21,"value":141},"Quran itself",{"type":21,"value":143},", which is the words of God, meant to guide us in this world.",{"type":16,"tag":17,"props":145,"children":146},{},[147],{"type":21,"value":148},"May Allah guide us all.",{"type":16,"tag":44,"props":150,"children":152},{"id":151},"selected-topics",[153],{"type":21,"value":154},"Selected Topics",{"type":16,"tag":156,"props":157,"children":159},"h3",{"id":158},"proofs-of-a-creator",[160],{"type":21,"value":161},"Proofs of a Creator",{"type":16,"tag":17,"props":163,"children":164},{},[165],{"type":21,"value":166},"It is impossible to imagine that a single CPU could come from a random process, even if given thousands of years. This tiny little machine (which was once larger) is quite simple to explain compared to the human body, the solar system, or many other creations. Looking at any creation on earth (even little insects), you can see a perfectly designed and complex system. Look at the sky, the earth, the different stars, the functioning of the human body, and reproduction systems. You will see wonders that cannot be the work of a human or anything less than that in terms of strength and intelligence.",{"type":16,"tag":17,"props":168,"children":169},{},[170],{"type":21,"value":171},"The principle of causality cannot be ignored. Nobody can imagine an effect coming from nowhere without something that caused it. This applies to the world we are living in, including all its creatures. We also cannot loop with causality forever; that is impossible. We must start with a first and unique thing, a thing that is independent of anything else that comes after it. And in order to create this complex world, this first thing necessarily has to be extremely powerful, knowledgeable, and much more. Some theorists may argue that it is a tiny cell. However, it would not make any sense. Because a tiny cell neither has the power to build a small part of the world we know nor the knowledge to design a perfectly functioning world. Not a single theory on how the world was created stands the ground, and all of them have been refuted over the years.",{"type":16,"tag":17,"props":173,"children":174},{},[175],{"type":21,"value":176},"This simple logic proves that the whole world necessarily has a creator.",{"type":16,"tag":156,"props":178,"children":180},{"id":179},"on-authenticating-information-and-history",[181],{"type":21,"value":182},"On Authenticating Information and History",{"type":16,"tag":17,"props":184,"children":185},{},[186],{"type":21,"value":187},"History is a valuable source of experiences, stories, and knowledge that can be of great benefit. Researchers base their current work on past findings and experiments, rather than starting from scratch. So, the past is a knowledge base that we can learn from. Therefore, it is crucial to filter and verify historical information before making any use of it. However, judging whether a historical event/story is true or not is not a matter of taste; flagging a story as fake because it does not align with the global worldview can be harmful (especially when ideas are coming from unqualified persons who never took the time to study related history). Even if historians have different methods to verify and authenticate information, they are often ignored by a wide majority who lead the judgment of certain events and stories.",{"type":16,"tag":17,"props":189,"children":190},{},[191],{"type":21,"value":192},"In an era of information, we tend to believe in audio-visual content. We might even feel that anything apart from that does not give enough confidence in the story. However, eyewitnesses might be of greater help than some audio-visual content (especially when considering GenAI). Further investigation could also be done. This includes understanding any reason that could motivate or prevent the eyewitness from lying. Also, understanding the relationship between eyewitnesses, and whether they are related or not, which would potentially make it easy or hard for them to agree on a single claim. It is also important to determine how truthful a specific eyewitness is.",{"type":16,"tag":17,"props":194,"children":195},{},[196],{"type":21,"value":197},"Books and information from the past can also be authenticated using methods that are way older than the ISBN system. These methods include cross-referencing, comparing copies from different sources, and analyzing handwritten pages.",{"type":16,"tag":17,"props":199,"children":200},{},[201],{"type":21,"value":202},"In conclusion, it is essential to keep in mind that reading or hearing a story from the Middle Ages or Ancient Rome should not be any different from the history of Islam. It is necessary to apply a correct process before judging whether a historical event/information is fake or truthful. This process often requires looking beyond information stored in an IT system.",{"type":16,"tag":156,"props":204,"children":206},{"id":205},"authenticity-of-hadiths-and-the-proof-of-a-prophet",[207],{"type":21,"value":208},"Authenticity of Hadiths and the Proof of a Prophet",{"type":16,"tag":17,"props":210,"children":211},{},[212],{"type":21,"value":213},"Whether or not one believes that Mohamed (peace be upon him) is a prophet, it should not affect the authentication process of what has been said about him. I have previously discussed how to examine historical events, so I will not repeat it here. However, I will focus on what makes the methods used for authenticating a Hadith (something the prophet said) special and unique. This will mainly explain the strength of authentic Hadith. By piecing together various authentic Hadiths, one can get a better understanding of who Mohamed (peace be upon him) was and believe in him as a prophet.",{"type":16,"tag":17,"props":215,"children":216},{},[217],{"type":21,"value":218},"Historians and scholars have a strict process to authenticate a Hadith that no one else uses to claim a historical event happened. This process provides a high level of certainty about the Hadith at hand. The same process is also used to verify things that have been said about the prophet (peace be upon him). It involves the validation of all five properties below (described briefly in simple terms):",{"type":16,"tag":220,"props":221,"children":223},"h4",{"id":222},"known-and-connected-chain-of-narration",[224],{"type":21,"value":225},"Known and Connected Chain of Narration",{"type":16,"tag":17,"props":227,"children":228},{},[229],{"type":21,"value":230},"The chain of narration of a particular Hadith is a list of individuals who heard the Hadith in a specific order, from the prophet who first spoke it to the most recent person we know of. If, for example, I hear a Hadith from C, who heard it from B, who heard it from A, who heard it from the prophet (peace be upon him), and all three individuals (A, B, and C) are well-known, then we say that the chain of narration is connected. However, if I hear a Hadith but cannot trace it back to the Prophet because I don't know from whom C heard it or because B is an unknown individual, then the chain of narration is disconnected. In such a case, we do not consider the Hadith to be authentic.",{"type":16,"tag":17,"props":232,"children":233},{},[234],{"type":21,"value":235},"To give you a sense of what I mean by “well-known” individuals in a chain of narration, let me tell you that Islamic historians wrote books that contain extensive biographies of thousands of narrators. An example is a book titled “أسد الغابة في معرفة الصحابة” (written by Ibn al-Athir). What I also mean by “extensive biographies” is that we can learn about who they knew, who they learned from, who they met during their lives, whether they had good memorization, and whether they were truthful individuals, among other things. All this information is needed to verify the different properties. For instance, if C says that they heard something from B, we need to ensure that B and C had actually met in the first place.",{"type":16,"tag":220,"props":237,"children":239},{"id":238},"memorization-strength",[240],{"type":21,"value":241},"Memorization Strength",{"type":16,"tag":17,"props":243,"children":244},{},[245],{"type":21,"value":246},"The individuals in the chain of narration must all have excellent memorization skills. If only one in the chain is known for making mistakes, then the Hadith cannot be considered authentic. One way to verify this is to compare the same Hadith from different chains of narrations; if one version differs from the majority, and the narrator is not known for lying, then it may indicate weaknesses in memorization.",{"type":16,"tag":220,"props":248,"children":250},{"id":249},"sound-character",[251],{"type":21,"value":252},"Sound Character",{"type":16,"tag":17,"props":254,"children":255},{},[256],{"type":21,"value":257},"The individuals in the chain of narration must all have a sound character. Anything that may contradict this would discard the authenticity of the Hadith. It means that narrators have to be trustworthy, respectful towards others, and not known for crossing social boundaries. If a narrator's character is questionable, his narration would not be considered authentic.",{"type":16,"tag":220,"props":259,"children":261},{"id":260},"abnormal-uniqueness",[262],{"type":21,"value":263},"Abnormal Uniqueness",{"type":16,"tag":17,"props":265,"children":266},{},[267],{"type":21,"value":268},"This property is not easy to explain briefly, so we can just say that if a Hadith was narrated through an unusual or unexpected chain (thus abnormal), then we would not consider the Hadith as authentic.",{"type":16,"tag":220,"props":270,"children":272},{"id":271},"free-from-defects",[273],{"type":21,"value":274},"Free from Defects",{"type":16,"tag":17,"props":276,"children":277},{},[278],{"type":21,"value":279},"It means that the content of the Hadith itself needs to be coherent with the whole religion. Verifying this property requires looking at the big picture and seeing how the Hadith fits into it. For example, if a Hadith could satisfy all 4 past criteria, but still instruct Muslims to steal money from others, then it cannot be authentic. Because it contradicts an essential aspect of Islam, which is clear from other Hadiths and the Quran.",{"type":16,"tag":17,"props":281,"children":282},{},[283],{"type":21,"value":284},"As we said previously, a Hadith must have ALL these five properties to be authentic. If one of these properties falls, the Hadith is not authentic.",{"type":16,"tag":17,"props":286,"children":287},{},[288],{"type":21,"value":289},"Based on authentic narrations, it is known that prophet Mohamed (peace be upon him) was recognized for his good character and trustworthiness. This was evident during the 40 years he lived among his community as a non-prophet. He was then sent by Allah as a messenger, to tell people to worship Allah alone. He lived a modest life as proof that he did not seek any personal gain from his mission. He also taught the people around him to exhibit good character. The Quran was revealed to him over the remaining 23 years of his life. It serves as a guide for people to know what they are here for. ",{"type":16,"tag":17,"props":291,"children":292},{},[293,295,302],{"type":21,"value":294},"This is a summary of the prophet's life, but many books have been written on the topic, one of which is ",{"type":16,"tag":81,"props":296,"children":299},{"href":297,"rel":298},"https://www.amazon.com/Ar-Raheeq-Al-Makhtum-Sealed-Nectar-Biography/dp/1591440718",[96],[300],{"type":21,"value":301},"The Sealed Nectar",{"type":21,"value":303},".",{"type":16,"tag":156,"props":305,"children":307},{"id":306},"quran",[308],{"type":21,"value":309},"Quran",{"type":16,"tag":17,"props":311,"children":312},{},[313,315,326],{"type":21,"value":314},"First, I want you to picture what the Quran is: it is a book composed of 114 chapters. Each chapter is composed of several verses (some chapters have more than 200 verses). The book is about 600 pages. Now this is the Quran as we know it today, but how was it revealed? Was the entire book revealed in a single time? Chapter by chapter? Verse by verse? The answer is not as you would expect. The Quran was revealed over 23 years. It was not revealed in order, but every set of verses was revealed in a specific context, based on the events surrounding the prophet (peace be upon him). There were neither chapter numbers nor verse numbers. They were circumstantial verses. So the book we have today is a final ordering of these circumstantial verses within chapters. A book that is coherent in its entirety ",{"type":16,"tag":77,"props":316,"children":317},{},[318],{"type":16,"tag":81,"props":319,"children":323},{"href":320,"ariaDescribedBy":321,"dataFootnoteRef":7,"id":322},"#user-content-fn-fn3",[85],"user-content-fnref-fn3",[324],{"type":21,"value":325},"3",{"type":21,"value":327},". Now if you think about it: is it even possible for a human being to write a book in 23 years, by mainly writing notes that answer events surrounding him, then finally ordering them in a 100% coherent way? This is impossible. It requires you at least to know the events that are going to happen in the future.",{"type":16,"tag":17,"props":329,"children":330},{},[331],{"type":21,"value":332},"Now, this is one argument that the Quran is not the work of a human, and its content tells us more about the one and only creator of this world, the only one worthy of worship: Allah. It also resembles previous books revealed to other prophets, even if we do not have their original content nowadays.",{"type":16,"tag":17,"props":334,"children":335},{},[336],{"type":21,"value":337},"The Quran also presents a simple challenge to humanity: create a similar book or at least a single chapter. A large group can work together on this; it does not matter. If you can come up with something like this, then you would be able to destroy the Quran as a revelation from Allah. With more than 1400 years since its revelation, no one was even close to solving the challenge, and no one will ever be.",{"type":16,"tag":17,"props":339,"children":340},{},[341,343,349],{"type":21,"value":342},"You can read the English translation of the Quran in ",{"type":16,"tag":81,"props":344,"children":346},{"href":137,"rel":345},[96],[347],{"type":21,"value":348},"SurahApp here",{"type":21,"value":350},". You can navigate chapters and verses from the sidebar. Chapters are called Surah, and verses are called Aya.",{"type":16,"tag":156,"props":352,"children":354},{"id":353},"authenticity-of-quran",[355],{"type":21,"value":356},"Authenticity of Quran",{"type":16,"tag":17,"props":358,"children":359},{},[360],{"type":21,"value":361},"The Quran is widely available across the globe. You can find it in written books, and mobile/web applications. Muslims also memorize it entirely. This last one is how the Quran has been transferred from one generation to the other. Every Hafiz (a person who memorizes the Quran) knows the person he learned the Quran from, and from whom his teacher learned it, and so on. This goes up to the prophet (peace be upon him). Today, if you look into the Quran from any source, either from a book, or listen to it from a Hafiz: it will always be the same, without a single letter difference. So, the Quran we have today is authentic because all its sources match a single version. We can even conclude with a high degree of confidence that a document is original even if there are slight differences in documents from different sources. Hence, the Quran is at an even higher level of confidence regarding its authenticity.",{"type":16,"tag":363,"props":364,"children":367},"section",{"className":365,"dataFootnotes":7},[366],"footnotes",[368,375],{"type":16,"tag":44,"props":369,"children":372},{"className":370,"id":85},[371],"sr-only",[373],{"type":21,"value":374},"Footnotes",{"type":16,"tag":376,"props":377,"children":378},"ol",{},[379,395,415],{"type":16,"tag":380,"props":381,"children":383},"li",{"id":382},"user-content-fn-fn1",[384,386],{"type":21,"value":385},"Of course, not everything you hear about prophets is necessarily correct. You will have to apply the same methods you would do to verify any historical information, and you can check the section dedicated to history in selected topics. ",{"type":16,"tag":81,"props":387,"children":392},{"href":388,"ariaLabel":389,"className":390,"dataFootnoteBackref":7},"#user-content-fnref-fn1","Back to reference 1",[391],"data-footnote-backref",[393],{"type":21,"value":394},"↩",{"type":16,"tag":380,"props":396,"children":398},{"id":397},"user-content-fn-fn2",[399,406,408],{"type":16,"tag":81,"props":400,"children":403},{"href":401,"rel":402},"https://web.surahapp.com/en/quran?surah=56&view=translation",[96],[404],{"type":21,"value":405},"Chapter 56",{"type":21,"value":407}," ",{"type":16,"tag":81,"props":409,"children":413},{"href":410,"ariaLabel":411,"className":412,"dataFootnoteBackref":7},"#user-content-fnref-fn2","Back to reference 2",[391],[414],{"type":21,"value":394},{"type":16,"tag":380,"props":416,"children":418},{"id":417},"user-content-fn-fn3",[419,421],{"type":21,"value":420},"You can get an idea from “Structure and Qur'anic Interpretation: A Study of Symmetry and Coherence in Islam's Holy Text” by Raymond Farrin ",{"type":16,"tag":81,"props":422,"children":426},{"href":423,"ariaLabel":424,"className":425,"dataFootnoteBackref":7},"#user-content-fnref-fn3","Back to reference 3",[391],[427],{"type":21,"value":394},{"title":7,"searchDepth":429,"depth":429,"links":430},2,[431,432,433,441],{"id":46,"depth":429,"text":49},{"id":57,"depth":429,"text":60},{"id":151,"depth":429,"text":154,"children":434},[435,437,438,439,440],{"id":158,"depth":436,"text":161},3,{"id":179,"depth":436,"text":182},{"id":205,"depth":436,"text":208},{"id":306,"depth":436,"text":309},{"id":353,"depth":436,"text":356},{"id":85,"depth":429,"text":374},"markdown","content:blog:meaning-of-life.md","content","blog/meaning-of-life.md","md",1720349581524]