[{"data":1,"prerenderedAt":218},["Reactive",2],{"content-query-7aeURCt1sF":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"date":10,"image":11,"draft":6,"body":12,"_type":213,"_id":214,"_source":215,"_file":216,"_extension":217},"/blog/reinforcement-learning","blog",false,"","Understanding the Basics of Reinforcement Learning","We will start with the story of Agent-S, someone that never went to the beach before, one day he was put into the center of the ocean, he doesn't have any prior knowledge of how to swim, but he is scary...","2019-08-14T00:00:00.000Z","/img/reinforcement-learning.jpg",{"type":13,"children":14,"toc":206},"root",[15,52,57,64,137,146,151,157,162,170,175,181,186,192],{"type":16,"tag":17,"props":18,"children":19},"element","p",{},[20,23,32,34,41,43,50],{"type":21,"value":22},"text","I took part of the Deep Learing with Pytorch challenge sponsored by Facebook the last months and I had the chance to learn from two amazing Nanodegrees at ",{"type":16,"tag":24,"props":25,"children":29},"a",{"href":26,"rel":27},"https://www.udacity.com/",[28],"nofollow",[30],{"type":21,"value":31},"Udacity",{"type":21,"value":33},", the first is the ",{"type":16,"tag":24,"props":35,"children":38},{"href":36,"rel":37},"https://www.udacity.com/course/deep-learning-nanodegree--nd101",[28],[39],{"type":21,"value":40},"Deep Learning Nanodegree",{"type":21,"value":42}," and the second is the ",{"type":16,"tag":24,"props":44,"children":47},{"href":45,"rel":46},"https://www.udacity.com/course/deep-reinforcement-learning-nanodegree--nd893",[28],[48],{"type":21,"value":49},"Deep Reinforcement Learning Nanodegree",{"type":21,"value":51}," which I loved from the beginning, the content is just fascinating. Today I will try to explain reinforcement learning through a simple example.",{"type":16,"tag":17,"props":53,"children":54},{},[55],{"type":21,"value":56},"We will start with the story of Agent-S, someone that never went to the beach before, one day he was put into the center of the ocean, he doesn't have any prior knowledge of how to swim, but he is scary and surely will try to survive, so he starts drowning and can't breathe anymore because of the water, so he randomly starts moving his hands up and down and got his head outside of the water and can now breathe again, he starts drawing again just after stopping his moves so this time he moves his hands and feet at the same time and realized that he got higher and was able to breathe more quickly than the first time when he moved his hands only. Agent-S was able to learn how to swim just by interacting with the environment, basically, he was performing actions (move hands, move feet, stay) while being in different states (underwater, above water) and was getting feedback from the environment on how good his actions were (able to breathe or not), next we will try to go from this analogy to explain reinforcement learning.",{"type":16,"tag":58,"props":59,"children":61},"h2",{"id":60},"reinforcement-learning",[62],{"type":21,"value":63},"Reinforcement learning",{"type":16,"tag":17,"props":65,"children":66},{},[67,69,75,77,82,84,89,91,96,98,102,104,108,110,115,117,122,124,128,130,135],{"type":21,"value":68},"Wikipedia defines RL as an area of machine learning concerned with how ",{"type":16,"tag":70,"props":71,"children":72},"strong",{},[73],{"type":21,"value":74},"agents",{"type":21,"value":76}," ought to take ",{"type":16,"tag":70,"props":78,"children":79},{},[80],{"type":21,"value":81},"actions",{"type":21,"value":83}," in an ",{"type":16,"tag":70,"props":85,"children":86},{},[87],{"type":21,"value":88},"environment",{"type":21,"value":90}," so as to maximize some notion of ",{"type":16,"tag":70,"props":92,"children":93},{},[94],{"type":21,"value":95},"cumulative reward",{"type":21,"value":97},". Let's demystify some of the terms here. The agent is just the party responsible of taking decisions on which action to perform next (it is Agent-S learning to swim in our example, it may be a self driving car or a simple software able to play chess as well), this agent has a certain level of interaction with the environment, in our example, Agent-S is in the middle of the ocean and can act on the ",{"type":16,"tag":70,"props":99,"children":100},{},[101],{"type":21,"value":88},{"type":21,"value":103}," by moving his arms and feet and can know the position he is in (underwater or not), we call ",{"type":16,"tag":70,"props":105,"children":106},{},[107],{"type":21,"value":81},{"type":21,"value":109}," the set of possible moves the agent can make and ",{"type":16,"tag":70,"props":111,"children":112},{},[113],{"type":21,"value":114},"states",{"type":21,"value":116}," the set of possible situations the agent can be in with respect to the environment. Now when the agent acts on the environment (like moving hands) he gets a certain feedback about how well he is doing so he can know if the action he just did was a good choice in the state he was in (getting outside the water is a good sign that the last action was a good choice), we call that feedback a ",{"type":16,"tag":70,"props":118,"children":119},{},[120],{"type":21,"value":121},"reward",{"type":21,"value":123},", and the mission of the agent (should he choose to accept it) would be to maximize the rewards he gets over time which is called ",{"type":16,"tag":70,"props":125,"children":126},{},[127],{"type":21,"value":95},{"type":21,"value":129},", in our example, Agent-S will try to keep his head outside of the water as much as he can so that he can breathe (getting the maximum ",{"type":16,"tag":70,"props":131,"children":132},{},[133],{"type":21,"value":134},"cumulative rewards",{"type":21,"value":136}," instead of being underwater and incapable of breathing).",{"type":16,"tag":17,"props":138,"children":139},{},[140],{"type":16,"tag":141,"props":142,"children":145},"img",{"alt":143,"src":144},"sar with environment","/img/sar-with-environment.jpg",[],{"type":16,"tag":17,"props":147,"children":148},{},[149],{"type":21,"value":150},"To be able to learn to maximize the cumulative reward, the agent will need to interact with the environment for a period of time exploring possible actions and their associated rewards (being in state St, make action At and get the reward Rt+1 and next state St+1), after enough interactions he can build the necessary knowledge to take the best possible action in the situation he would be in, this knowledge he builds is what we call a policy. A policy is what tells the agent while being in state S to choose a certain action A. Okay, but how does the agent learn the policy?",{"type":16,"tag":58,"props":152,"children":154},{"id":153},"the-learning-phase",[155],{"type":21,"value":156},"The Learning Phase",{"type":16,"tag":17,"props":158,"children":159},{},[160],{"type":21,"value":161},"Now that we learned about the basics of RL, let's build some intuition on how RL agents learn. We said that an agent being in state S must be able to choose from the set of available actions the one that will maximize its cumulative reward, let's say the agent is at state St and he has 3 available actions A1, A2 and A3, with their respective cumulative rewards as -10, 2, and 6, the agent will basically choose the third one as it's the best reward he can get, okay, but from where did these numbers come from? in a simple problem when we have a discrete set of states and actions, we can build what we call a Q-table, it's a table with states as rows and actions as columns.",{"type":16,"tag":17,"props":163,"children":164},{},[165],{"type":16,"tag":141,"props":166,"children":169},{"alt":167,"src":168},"q table","/img/qtable.jpg",[],{"type":16,"tag":17,"props":171,"children":172},{},[173],{"type":21,"value":174},"The cell for state S and action A is the cumulative reward the agent will get if starting at state S and choosing the action A, so now when we are at state S we can choose the best action that will maximize the rewards. I will not detail how the Q-table is computed, however, you already got an intuition about that, it's through experimentation with the environment and exploration of different actions in different states, some algorithms that can be used to build the Q-table are Monte Carlo Control and Sarsa.",{"type":16,"tag":58,"props":176,"children":178},{"id":177},"whats-next",[179],{"type":21,"value":180},"What's next?",{"type":16,"tag":17,"props":182,"children":183},{},[184],{"type":21,"value":185},"It's true that the method that we described here can be used to solve a panoply of problems, however, Q-tables are limited in term of dimensions, you can't build a Q-table for a problem that have an infinite set of states or actions, like have a state represented as continuous value between -10 and 10. To solve this issue we may use function estimation: a way of finding a function F that can estimate the cumulative reward from a given state and action, if you are familiar with deep learning then you might already smelt neural networks here, this is actually where Deep RL begins.",{"type":16,"tag":58,"props":187,"children":189},{"id":188},"conclusion",[190],{"type":21,"value":191},"Conclusion",{"type":16,"tag":17,"props":193,"children":194},{},[195,197,204],{"type":21,"value":196},"I hope you have enjoyed this quick and simple introduction to reinforcement learning, if you want to read about RL use cases, then I suggest to start with ",{"type":16,"tag":24,"props":198,"children":201},{"href":199,"rel":200},"https://deepmind.com/research/alphago/",[28],[202],{"type":21,"value":203},"AlphaGo",{"type":21,"value":205},", the first computer program to defeat a professional human Go player.",{"title":7,"searchDepth":207,"depth":207,"links":208},2,[209,210,211,212],{"id":60,"depth":207,"text":63},{"id":153,"depth":207,"text":156},{"id":177,"depth":207,"text":180},{"id":188,"depth":207,"text":191},"markdown","content:blog:reinforcement-learning.md","content","blog/reinforcement-learning.md","md",1744823802068]